package org.example.wordle.repository;

import java.util.Arrays;
import java.util.HashSet;
import java.util.List;

public class WordsRepository {

    public static List<String> getWordList() {

        return Arrays.asList(
                "АБЗАЦ", "АВТОР", "АГЕНТ", "АДРЕС", "АЗАРТ", "АЗИАТ", "АКТИВ", "АЛМАЗ",
                "АМПЕР", "АНГАР", "АРБУЗ", "АРЕНА", "АРХИВ", "АТЛАС",
                "БАГАЖ", "БАЗАР", "БАЙКА", "БАЛЕТ", "БАНАН", "БАРЖА", "БАСНЯ", "БАТОН", "БЕГУН", "БЕЛКА",
                "БЕРЕГ", "БИЛЕТ", "БИРЖА", "БОКАЛ", "БОМБА",
                "ВАГОН", "ВАЗОН", "ВАЛЕТ", "ВАЛЬС", "ВАННА", "ВЕСНА", "ВЕТКА", "ВИДЕО", "ВИЛКА",
                "ВОЛНА", "ВОРОТ", "ВЫБОР", "ГАЗОН", "ГАММА", "ГАРАЖ",
                "ГЕРОЙ", "ГОЛОС", "ГОРКА", "ГРУША", "ГУСАК", "ДАВКА",
                "ДЕБЕТ", "ДЕТКА", "ДИВАН", "ДОБРО",
                "ДОСКА", "ДОЧКА", "ДУБОК", "ЕПАРХ", "ЕРЕСЬ", "ЖАТВА", "ЖИВОТ",
                "ЗАБОР", "ЗАВОД", "ЗАГАР", "ЗАКАЗ", "ЗАМОК", "ЗАПАД", "ЗЕБРА", "ЗЕМЛЯ",
                "ИДЕАЛ", "ИКОНА", "ИСТОК", "КАБАН", "КАЗАК", "КАНАЛ", "КАПЛЯ", "КАРТА", "КАТОК",
                "КЛАСС", "КНИГА", "КОЛОС", "КОНЕЦ", "КОПИЯ", "КРЕСТ", "КРОВЬ",
                "КУКЛА", "ЛАВКА", "ЛАМПА", "ЛИМОН", "ЛОЖКА", "МАГИЯ", "МАСЛО", "МЕСТО", "МЕТРО",
                "НАРОД", "НЕФТЬ", "НУЖДА", "ОГОНЬ", "ОЗЕРО", "УСПЕХ", "АВТОР", "БАГАЖ", "ВЕТКА", "ГЛАЗА", "ЖИЗНЬ", "ИГРОК",
                "УСПЕХ", "АВТОР", "БАГАЖ", "ВЕТКА", "ГЛАЗА", "ЖИЗНЬ", "ИГРОК",
                "КАРТА", "МАСКА", "ПАРТА", "РЫБАК", "ТАБЛО", "ФИЛЬМ", "ШАПКА", "ЭКРАН",
                "АКТЁР", "АМЁБА", "АФЁРА", "АКЦИЯ", "АЛЛЕЯ", "АРМИЯ",
                "БРАВО", "БРАГА", "БРАНЬ", "БРАСС", "БРЕМЯ", "БРЕНД", "БРЕШЬ",
                "ВОПЁЖ", "ВАФЛЯ", "ГАЯТЬ", "ГЛЯСЕ", "ГОЛЯК", "ДОМЁК", "ДВОЯК", "ЗАЛЁТ", "ЗАВЕЯ", "ЗАРЯД", "ЗАТЕЯ",
                "КОВЁР", "КОЗЁЛ", "КОПЬЁ", "КОТЁЛ", "КУЛЁК", "КУТЁЖ",
                "ЛАРЁК", "ЛИКЁР", "ЛИТЬЁ", "ЛАДЬЯ", "ЛАЗНЯ", "ЛЕПНЯ",
                "ЛИЛИЯ", "БИЛЕТ", "КНИГА", "ВЕСНА", "ОГОНЬ", "ДРОВА", "ПЕСОК", "СТЕПЬ", "ГОРОД", "ПТИЦА",
                "РУЧЕЙ", "КАМНИ", "ЛЫЖНЯ", "ЧАЙКА", "САХАР", "СЕДЛО", "ПОЕЗД", "ЛАМПА",
                "ДИВАН", "РУЧКА", "КИСТЬ", "ТАНЕЦ", "ЗАРЯД", "ШАПКА", "ОБУВЬ", "НИТКА", "ТКАНЬ",
                "ЖИЛЕТ", "НОСКИ", "САПОГ", "РАМКА", "ФИЛЬМ", "СЦЕНА", "АКТЁР", "РОЛИК", "ДУБЛЬ", "СЮЖЕТ",
                "МЫСЛЬ", "РИФМА", "БУКВА", "ШКОЛА", "НАУКА", "ХИМИЯ", "ЧИСЛО", "ПАПКА",
                "ТЕКСТ", "ШРИФТ", "СКРИП", "ДОМЕН", "ПОЧТА", "ДРАЙВ"
        );
    }
}
